Revit 2027 API
BuiltInFailures.LinkFailures.WatchedLinkMoved Property
 Monitored Link moved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WatchedLinkMoved { get; }
Public Shared ReadOnly Property WatchedLinkMoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WatchedLinkMoved {
	FailureDefinitionId^ get ();
}
static member WatchedLinkMoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace